#### DocumentSaveToLocalProgressChangedEventArgs Members

---

|  |
| --- |
| DocumentSaveToLocalProgressChangedEventArgs Class   Methods   Properties   See Also |

The  DocumentSaveToLocalProgressChangedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RevitAPIEventArgs  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsCancelled | Indicates whether the event is being cancelled. (Inherited from  RevitAPIEventArgs  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BeforeSaveToCentral | True if the "save to local" operation is occurring before "save to central"; false if after. |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitAPIEventArgs  .) |
| Public property | FinishedStreams | The number of streams finished since the last time this event was raised. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RevitAPIEventArgs  .) |
| Public property | Location | Full path of the central model which is to be operated. (Inherited from  WorksharedOperationProgressChangedEventArgs  .) |
| Public property | SaveToLocalFinished | Indicates if the current "save to local" operation has finished. |
| Public property | Status | Gets API event status, reflect current operation execution status. (Inherited from  WorksharedOperationProgressChangedEventArgs  .) |
| Public property | TotalStreams | The total expected number of streams to save to local. |

# See Also

DocumentSaveToLocalProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace